org-publisg.org

Fichero =makefile= que genera el directorio público =docs= con los ficheros para GitPages con subdirectorios para los =CuadernosElectronicos=, =pdfs=, =Transparencias= y los ficheros con las lecciones en ~html~:

#+BEGIN_SRC makefile :noweb no-export :results silent :exports none :tangle makefile
LECCIONES_SRC = ./org-lessons
LECCIONES = ./lecciones
DOCS = ./docs
CUADERNOS = $(DOCS)/CuadernosElectronicos
TRANSPARENCIAS = $(DOCS)/Transparencias

SRC_FILES = $(LECCIONES_SRC)/Lecc*.org

.PHONY: all clean cleanAll directorios series_formales calendario notebooksYslides

all: notebooksYslides calendario

calendario: $(DOCS)/Calendario-Econometria-Aplicada.pdf

$(DOCS)/Calendario-Econometria-Aplicada.pdf:
	emacs --batch Calendario/README.org -l org -f org-babel-tangle
	cd Calendario && make Calendario-Econometria-Aplicada.pdf

notebooksYslides: $(patsubst $(LECCIONES_SRC)/%.org,$(CUADERNOS)/%.ipynb,$(wildcard $(SRC_FILES)))

$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios
	make series_formales
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES)
	cp -a $< $(LECCIONES)
	emacs --batch \
	  --load ~/.emacs.d/no-tlmgr.el \
	  --load ~/Software/scimax/init.el \
	  -l publica.el
#	# Exportar el archivo .org a .ipynb
#	emacs --batch \
#	  --load ~/.emacs.d/no-tlmgr.el \
#	  --load ~/Software/scimax/init.el \
#	  --eval "(require 'ox-ipynb)" \
#	  $(LECCIONES)/$(@F:.ipynb=.org)
#	# Ejecutar el notebook con jupyter nbconvert
#	jupyter nbconvert --execute --inplace $(LECCIONES)/$(@F) 
#	jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix "https://unpkg.com/reveal.js@5.2.1" --execute $(LECCIONES)/$(@F) 
#	jupyter nbconvert --execute --to html $(LECCIONES)/$(@F) 
#	# Mover los archivos generados
	mv $(LECCIONES)/$(@F) $(CUADERNOS)
	mv $(LECCIONES)/$(@F:.ipynb=.slides.html) $(TRANSPARENCIAS)
	cp -a $(LECCIONES)/img/* $(DOCS)/img/
#	mv $(LECCIONES)/$(@F:.ipynb=.html) $(DOCS)


series_formales: $(LECCIONES_SRC)/src/implementacion_series_formales.org
	make directorios
	cp $< $(LECCIONES)/src/
	emacs --batch $(LECCIONES)/src/implementacion_series_formales.org -l org -f org-babel-tangle
	cp -a $(LECCIONES)/src/implementacion_series_formales.py $(CUADERNOS)/src/
	ln -sf -r $(CUADERNOS)/src/implementacion_series_formales.py $(CUADERNOS)/
	emacs --batch \
	  --load ~/.emacs.d/no-tlmgr.el \
	  --load ~/Software/scimax/init.el \
	  --eval "(require 'ox-ipynb)" \
	  --eval "(ox-ipynb-export-org-file-to-ipynb-file \"lecciones/src/implementacion_series_formales.org\")"
	jupyter nbconvert --execute --inplace $(LECCIONES)/src/implementacion_series_formales.ipynb
	jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix "https://unpkg.com/reveal.js@5.2.1" --execute $(LECCIONES)/src/implementacion_series_formales.ipynb
	jupyter nbconvert --execute --to html $(LECCIONES)/src/implementacion_series_formales.ipynb
	mv $(LECCIONES)/src/implementacion_series_formales.ipynb $(CUADERNOS)
	mv $(LECCIONES)/src/implementacion_series_formales.slides.html $(TRANSPARENCIAS)
	mv $(LECCIONES)/src/implementacion_series_formales.html $(DOCS)
	touch $@

directorios:
	mkdir -v -p $(LECCIONES)/src
	mkdir -v -p $(LECCIONES)/img
	mkdir -v -p $(DOCS)/img
	mkdir -v -p $(DOCS)/pdfs
	mkdir -v -p $(TRANSPARENCIAS)
	mkdir -v -p $(CUADERNOS)/src
	ln -snf -r $(DOCS)/img/ $(TRANSPARENCIAS)/
	ln -snf -r $(DOCS)/img/ $(CUADERNOS)/
	touch directorios

clean:
	rm -r -f $(LECCIONES)

cleanAll: clean
	find $(DOCS)/ -mindepth 1 ! -name 'README.org' -exec rm -rf {} +
	rm -f directorios
	rm -f series_formales
#+END_SRC

Makefile para que sea totalmente compatible con el build.yml que definimos. Los cambios clave son:

Se utiliza emacs --batch con --load ~/.emacs.d/no-tlmgr.el para evitar el problema con tlmgr.

Se asegura que ox-ipynb y ob-jupyter se cargan explícitamente.

Se evita la evaluación de bloques automáticamente, salvo en los casos que lo necesitas.

Se mantiene toda tu lógica de directorios, copias, y nbconvert.


$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios
	make series_formales
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES)
	cp -a $< $(LECCIONES)
	emacs --batch \
	  --load ~/.emacs.d/no-tlmgr.el \
	  --load ~/Software/scimax/init.el \
	  --eval "(setq org-confirm-babel-evaluate nil)" \
	  --eval "(require 'ox-ipynb)" \
	  --eval "(require 'ob-jupyter)" \
	  $(LECCIONES)/$(@F:.ipynb=.org) \
	  -f org-babel-execute-buffer --kill
	mv $(LECCIONES)/$(@F:.ipynb=.ipynb) $(CUADERNOS)
	mv $(LECCIONES)/$(@F:.ipynb=.slides.html) $(TRANSPARENCIAS)

$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios
	make series_formales
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES)
	cp -a $< $(LECCIONES)
	emacs --batch \
	  --load ~/.emacs.d/no-tlmgr.el \
	  --load ~/Software/scimax/init.el \
	  --eval "(require 'ox-ipynb)" \
	  --eval "(org-babel-execute-buffer)" \
	  $(LECCIONES)/$(@F:.ipynb=.org) \
	  -f org-babel-execute-buffer --kill
	mv $(LECCIONES)/$(@F:.ipynb=.ipynb) $(CUADERNOS)
	mv $(LECCIONES)/$(@F:.ipynb=.slides.html) $(TRANSPARENCIAS)

#	#emacs -q -l ~/Software/scimax/init.el $(LECCIONES)/$(@F:.ipynb=.org) --batch -f org-babel-execute-buffer --kill

#+BEGIN_SRC makefile :noweb no-export :results silent :exports none :tangle OLDmakefile.old
# Directorios
LECCIONES_SRC = ./org-lessons
LECCIONES = ./lecciones
DOCS = ./docs
CUADERNOS = $(DOCS)/CuadernosElectronicos
TRANSPARENCIAS = $(DOCS)/Transparencias

# Patrón para los archivos fuente
SRC_FILES = $(LECCIONES_SRC)/Lecc*.org

# Regla principal
all: notebooksYslides calendario
	emacs -q -l ~/Software/scimax/init.el -batch -nw -l publica.el

calendario: $(DOCS)/Calendario-Econometria-Aplicada.pdf

$(DOCS)/Calendario-Econometria-Aplicada.pdf:
	emacs --batch Calendario/README.org -l org -f org-babel-tangle
	cd Calendario && make Calendario-Econometria-Aplicada.pdf

notebooksYslides: $(patsubst $(LECCIONES_SRC)/%.org,$(CUADERNOS)/%.ipynb,$(wildcard $(SRC_FILES)))

# Regla para generar notebooks y slides
$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios 
	make series_formales
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES)
	cp -a $< $(LECCIONES)
	emacs -q -l ~/Software/scimax/init.el $(LECCIONES)/$(@F:.ipynb=.org) --batch -f org-babel-execute-buffer --kill
	mv $(LECCIONES)/$(@F:.ipynb=.ipynb) $(CUADERNOS)
	mv $(LECCIONES)/$(@F:.ipynb=.slides.html) $(TRANSPARENCIAS)

series_formales: $(LECCIONES_SRC)/src/implementacion_series_formales.org
	make directorios 
	cp $< $(LECCIONES)/src/
	emacs --batch $(LECCIONES)/src/implementacion_series_formales.org -l org -f org-babel-tangle
	ln -s -r $(LECCIONES)/src/implementacion_series_formales.py $(LECCIONES)/
	cp -a $(LECCIONES)/src/implementacion_series_formales.py $(CUADERNOS)/src/
	ln -s -r $(CUADERNOS)/src/implementacion_series_formales.py $(CUADERNOS)/
	emacs -q -l ~/Software/scimax/init.el -batch -nw --eval "(require 'ox-ipynb)" --eval "(ox-ipynb-export-org-file-to-ipynb-file \"lecciones/src/implementacion_series_formales.org\")"
	jupyter nbconvert --execute --inplace $(LECCIONES)/src/implementacion_series_formales.ipynb
	jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix "https://unpkg.com/reveal.js@5.2.1" --execute $(LECCIONES)/src/implementacion_series_formales.ipynb
	jupyter nbconvert --execute --to html $(LECCIONES)/src/implementacion_series_formales.ipynb
	mv $(LECCIONES)/src/implementacion_series_formales.ipynb $(CUADERNOS)
	mv $(LECCIONES)/src/implementacion_series_formales.slides.html $(TRANSPARENCIAS)
	mv $(LECCIONES)/src/implementacion_series_formales.html $(DOCS)
	touch $@

directorios: 
	mkdir -v -p $(LECCIONES)/src
	mkdir -v -p $(LECCIONES)/img
	mkdir -v -p $(DOCS)/img
	mkdir -v -p $(DOCS)/pdfs
	mkdir -v -p $(TRANSPARENCIAS)
	mkdir -v -p $(CUADERNOS)/src
	ln -s -r $(DOCS)/img/ $(TRANSPARENCIAS)/
	ln -s -r $(DOCS)/img/ $(CUADERNOS)/
	touch directorios

clean:
	rm -r -f $(LECCIONES)

cleanAll: clean
	find $(DOCS)/ -mindepth 1 ! -name 'README.org' -exec rm -rf {} +
	rm -f directorios
	rm -f series_formales

#+END_SRC

Este script transforma los ficheros org de las lecciones en pdfs y htmls. 

#+BEGIN_SRC  emacs-lisp :tangle publica.el :results silent
;;; publica.el --- Publicación HTML y PDF para el repositorio Scimax-ELN

(require 'ox-publish)

(setq org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF tras ejecutar bloques de código."
  (message "Exportando a PDF: %s" filename)
  (with-current-buffer (find-file-noselect filename)
    (org-babel-execute-buffer)
    (org-latex-publish-to-pdf plist filename pub-dir)))

(let* ((base-directory "./lecciones/")
       (public-directory "./docs/"))
  (setq org-publish-project-alist
        `(("html"
           :base-directory ,base-directory
           :base-extension "org"
           :publishing-directory ,public-directory
           :exclude "src\\|docs\\|Calendario"
           :recursive t
           :publishing-function org-html-publish-to-html
           :auto-preamble t)

          ("pdf"
           :base-directory ,base-directory
           :base-extension "org"
           :publishing-directory ,(concat public-directory "pdfs")
           :exclude "src\\|docs\\|Calendario"
           :recursive t
           :publishing-function my-org-latex-publish-to-pdf
           :auto-preamble t)

          ("static-html"
           :base-directory ,base-directory
           :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|txt\\|svg\\|aiff\\|csv\\|gdt\\|inp\\|ipynb"
           :publishing-directory ,public-directory
           :exclude "src\\|docs\\|Calendario"
           :recursive t
           :publishing-function org-publish-attachment)

          ("scimax-eln" :components ("html" "static-html" "pdf"))))

  (message "🟢 Iniciando publicación de lecciones (scimax-eln)...")
  (org-publish "scimax-eln" t)
  (message "✅ Publicación de lecciones completada."))

(let* ((base-directory "./"))
  (setq org-publish-project-alist
        (append org-publish-project-alist
                `(("index"
                   :base-directory ,base-directory
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs")
                   :exclude "docs"
                   :recursive nil
                   :publishing-function org-html-publish-to-html
                   :auto-preamble t
                   :auto-sitemap t
                   :with-author nil
                   :with-creator nil
                   :with-toc t
                   :section-numbers nil)

                  ("static-index"
                   :base-directory ,base-directory
                   :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|txt\\|svg\\|aiff"
                   :publishing-directory ,(concat base-directory "docs")
                   :exclude "docs"
                   :recursive nil
                   :publishing-function org-publish-attachment)

                  ("web-repositorio" :components ("index" "static-index")))))

  (message "🟢 Iniciando publicación del índice (web-repositorio)...")
  (org-publish "web-repositorio" t)
  (message "✅ Publicación del índice completada."))

(unless (file-directory-p "logs")
  (make-directory "logs"))
(with-temp-file "logs/publica.log"
  (insert (format "Publicado el %s\n" (current-time-string))))

#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle publica.el.old :results silent
(require 'ox-publish)

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    (org-latex-publish-to-pdf plist filename pub-dir)))

(let* ((base-directory "./lecciones/")
       (public-directory "./docs/")
       (org-export-with-broken-links t)
       (org-publish-project-alist `(("html"
				     :base-directory ,base-directory
				     :base-extension "org"
                                     :publishing-directory ,public-directory
				     :exclude "src\\|docs\\|Calendario"
				     :recursive t
				     :publishing-function org-html-publish-to-html
				     :auto-preamble t
				     :auto-sitemap nil)
				    
				    ("pdf"
				     :base-directory ,base-directory
				     :base-extension "org"
				     :publishing-directory ,(concat public-directory "pdfs")
 				     :exclude "src\\|docs\\|Calendario"
				     :recursive t
				     :publishing-function my-org-latex-publish-to-pdf
				     :auto-preamble t
				     :auto-sitemap nil)
				    
				    ("static-html"
				     :base-directory ,base-directory
				     :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|txt\\|svg\\|aiff\\|csv\\|gdt\\|inp\\|ipynb"
				     :publishing-directory ,public-directory
				     :exclude "src\\|docs\\|Calendario"
				     :recursive t
				     :publishing-function org-publish-attachment)

				    ;; ... all the components ...
				    ("scimax-eln" :components ("html" "static-html" "pdf")))))

  (org-publish "scimax-eln" t))

  ;; Customize the HTML output
  (setq org-html-validation-link nil            ;; Don't show validation link
        org-html-head-include-scripts nil       ;; Use our own scripts
        org-html-head-include-default-style nil ;; Use our own styles
        ;org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />"
   )

  (let* ((base-directory "./")
         (org-export-with-broken-links t)
         (org-publish-project-alist `(("index"
  				     :base-directory ,base-directory
  				     :base-extension "org"
  				     :publishing-directory ,(concat base-directory "docs")
  				     :exclude "docs"
  				     :recursive nil
  				     :publishing-function org-html-publish-to-html
  				     :auto-preamble t
  				     :auto-sitemap t
                                       :with-author nil           ;; Don't include author name
                                       :with-creator nil          ;; Include Emacs and Org versions in footer
                                       :with-toc t                ;; Include a table of contents
                                       :section-numbers nil       ;; Don't include section numbers
                                       :time-stamp-file nil)
  				    
  				    ("static-index"
  				     :base-directory ,base-directory
  				     :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|txt\\|svg\\|aiff"
  				     :publishing-directory ,(concat base-directory "docs")
  				     :exclude "docs"
  				     :recursive nil
  				     :publishing-function org-publish-attachment)

  				    ;; ... all the components ...
  				    ;("scimax-eln" :components ("html" "static-html" "pdf")))))
  				    ("web-repositorio" :components ("index" "static-index")))))

    (org-publish "web-repositorio" t))
#+END_SRC


#+BEGIN_SRC emacs-lisp
(require 'ox-publish)

(defun my-org-babel-execute-buffer ()
  "Ejecuta todos los bloques de código en el buffer actual."
  (org-babel-execute-buffer))

(defun my-org-html-publish-to-html (plist filename pub-dir)
  "Publica un archivo Org como HTML después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    ;(my-org-babel-execute-buffer) ; Ejecuta los bloques
    (org-html-publish-to-html plist filename pub-dir)))

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    ;(my-org-babel-execute-buffer) ; Ejecuta los bloques
    (org-latex-publish-to-pdf plist filename pub-dir)))

(let* ((base-directory "./lecciones/")
       (public-directory "./docs/")
       (org-export-with-broken-links t)
       (org-publish-project-alist `(("html"
                                     :base-directory ,base-directory
                                     :base-extension "org"
                                     :publishing-directory ,public-directory
                                     :exclude ".ipynb_checkpoints\\|00Notas.*\\|org-publisg.*\\|kk.*\\|src"
                                     :recursive t
                                     :auto-preamble t
                                     :auto-sitemap t
				     :sitemap-title "Lecciones"
                                     :publishing-function my-org-html-publish-to-html
    				     :exclude-tags ("pdf"))
                                   
                                    ("pdf"
                                     :base-directory ,base-directory
                                     :base-extension "org"
                                     :publishing-directory ,(concat public-directory "pdfs")
                                     :exclude ".ipynb_checkpoints\\|src\\|sitemap.pdf"
                                     :recursive t
                                     :auto-preamble t
                                     :auto-sitemap nil
                                     :publishing-function my-org-latex-publish-to-pdf)
                                    
                                    ("static-html"
                                     :base-directory ,base-directory
                                     :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|svg\\|aiff\\|csv\\|gdt\\|inp\\|ipynb\\|html"
                                     :publishing-directory ,public-directory
                                     :exclude "docs\\|src\\|EjerciciosHide\\|.ipynb_checkpoints\\|org-publisg.*\\|kk.*\\|Lecc*.pdf\\|sitemap.pdf"
                                     :recursive t
                                     :publishing-function org-publish-attachment)

                                    ("scimax-eln" :components ("html" "static-html" "pdf")))))

  (org-publish "scimax-eln" t))

  ;; Customize the HTML output
  (setq org-html-validation-link nil            ;; Don't show validation link
        org-html-head-include-scripts nil       ;; Use our own scripts
        org-html-head-include-default-style nil ;; Use our own styles
        org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />")

  (let* ((base-directory "./")
         (org-export-with-broken-links t)
         (org-publish-project-alist `(("index"
  				     :base-directory ,base-directory
  				     :base-extension "org"
  				     :publishing-directory ,(concat base-directory "docs")
  				     :exclude "docs\\|org-publisg.org\\|chatCopilot.org"
  				     :recursive nil
  				     :publishing-function org-html-publish-to-html
  				     :auto-preamble t
  				     :auto-sitemap t
                                       :with-author nil           ;; Don't include author name
                                       :with-creator nil          ;; Include Emacs and Org versions in footer
                                       :with-toc t                ;; Include a table of contents
                                       :section-numbers nil       ;; Don't include section numbers
                                       :time-stamp-file nil)
  				    
  				    ("static-index"
  				     :base-directory ,base-directory
  				     :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|txt\\|svg\\|aiff"
  				     :publishing-directory ,(concat base-directory "docs")
  				     :exclude "docs\\|org-publisg.org\\|chatCopilot.org"
  				     :recursive nil
  				     :publishing-function org-publish-attachment)

  				    ;; ... all the components ...
  				    ;("scimax-eln" :components ("html" "static-html" "pdf")))))
  				    ("web-repositorio" :components ("index" "static-index")))))

    (org-publish "web-repositorio" t))

#+END_SRC

#+RESULTS:


Podemos chequear la versión local ejecutando el siguiente bloque

#+BEGIN_SRC emacs-lisp :results silent
(browse-url "docs/index.html")
#+END_SRC



