docs/org-publisg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-25 Fri 14:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org78639da">slides para GitHubpages</a></li>
</ul>
</div>
</div>
<p>
Fichero <code>makefile</code> que genera el directorio público <code>docs</code> con los ficheros para GitPages con subdirectorios para los <code>CuadernosElectronicos</code>, <code>pdfs</code>, <code>Transparencias</code> y los ficheros con las lecciones en <code>html</code>:
</p>

<p>
Makefile para que sea totalmente compatible con el build.yml que definimos. Los cambios clave son:
</p>

<p>
Se utiliza emacs &ndash;batch con &ndash;load ~/.emacs.d/no-tlmgr.el para evitar el problema con tlmgr.
</p>

<p>
Se asegura que ox-ipynb y ob-jupyter se cargan explícitamente.
</p>

<p>
Se evita la evaluación de bloques automáticamente, salvo en los casos que lo necesitas.
</p>

<p>
Se mantiene toda tu lógica de directorios, copias, y nbconvert.
</p>


<p>
$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios
	make series_formales
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES)
	cp -a $&lt; $(LECCIONES)
	emacs &ndash;batch \
	  &ndash;load ~/.emacs.d/no-tlmgr.el \
	  &ndash;load ~/Software/scimax/init.el \
	  &ndash;eval "(setq org-confirm-babel-evaluate nil)" \
	  &ndash;eval "(require 'ox-ipynb)" \
	  &ndash;eval "(require 'ob-jupyter)" \
	  \((LECCIONES)/\)(@F:.ipynb=.org) \
	  -f org-babel-execute-buffer &ndash;kill
	mv \((LECCIONES)/\)(@F:.ipynb=.ipynb) $(CUADERNOS)
	mv \((LECCIONES)/\)(@F:.ipynb=.slides.html) $(TRANSPARENCIAS)
</p>

<p>
$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios
	make series_formales
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES)
	cp -a $&lt; $(LECCIONES)
	emacs &ndash;batch \
	  &ndash;load ~/.emacs.d/no-tlmgr.el \
	  &ndash;load ~/Software/scimax/init.el \
	  &ndash;eval "(require 'ox-ipynb)" \
	  &ndash;eval "(org-babel-execute-buffer)" \
	  \((LECCIONES)/\)(@F:.ipynb=.org) \
	  -f org-babel-execute-buffer &ndash;kill
	mv \((LECCIONES)/\)(@F:.ipynb=.ipynb) $(CUADERNOS)
	mv \((LECCIONES)/\)(@F:.ipynb=.slides.html) $(TRANSPARENCIAS)
</p>

<p>
#	#emacs -q -l ~/Software/scimax/init.el \((LECCIONES)/\)(@F:.ipynb=.org) &ndash;batch -f org-babel-execute-buffer &ndash;kill
</p>

<p>
Este script transforma los ficheros org de las lecciones en pdfs y htmls. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">publica.el --- Publicaci&#243;n HTML y PDF para el repositorio Scimax-ELN
</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)

(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-latex-publish-to-pdf</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como PDF tras ejecutar bloques de c&#243;digo."</span>
  (message <span style="font-style: italic;">"Exportando a PDF: %s"</span> filename)
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    (org-babel-execute-buffer)
    (org-latex-publish-to-pdf plist filename pub-dir)))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./lecciones/"</span>)
       (public-directory <span style="font-style: italic;">"./docs/"</span>))
  (<span style="font-weight: bold;">setq</span> org-publish-project-alist
        `((<span style="font-style: italic;">"html"</span>
           <span style="font-weight: bold;">:base-directory</span> ,base-directory
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
           <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario"</span>
           <span style="font-weight: bold;">:recursive</span> t
           <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
           <span style="font-weight: bold;">:auto-preamble</span> t)

          (<span style="font-style: italic;">"pdf"</span>
           <span style="font-weight: bold;">:base-directory</span> ,base-directory
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,(concat public-directory <span style="font-style: italic;">"pdfs"</span>)
           <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario"</span>
           <span style="font-weight: bold;">:recursive</span> t
           <span style="font-weight: bold;">:publishing-function</span> my-org-latex-publish-to-pdf
           <span style="font-weight: bold;">:auto-preamble</span> t)

          (<span style="font-style: italic;">"static-html"</span>
           <span style="font-weight: bold;">:base-directory</span> ,base-directory
           <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">csv</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gdt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">inp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">ipynb"</span>
           <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
           <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario"</span>
           <span style="font-weight: bold;">:recursive</span> t
           <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

          (<span style="font-style: italic;">"scimax-eln"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"static-html"</span> <span style="font-style: italic;">"pdf"</span>))))

  (message <span style="font-style: italic;">"&#128994; Iniciando publicaci&#243;n de lecciones (scimax-eln)..."</span>)
  (org-publish <span style="font-style: italic;">"scimax-eln"</span> t)
  (message <span style="font-style: italic;">"&#9989; Publicaci&#243;n de lecciones completada."</span>))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./"</span>))
  (<span style="font-weight: bold;">setq</span> org-publish-project-alist
        (append org-publish-project-alist
                `((<span style="font-style: italic;">"index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs"</span>
                   <span style="font-weight: bold;">:recursive</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                   <span style="font-weight: bold;">:auto-preamble</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> t
                   <span style="font-weight: bold;">:with-author</span> nil
                   <span style="font-weight: bold;">:with-creator</span> nil
                   <span style="font-weight: bold;">:with-toc</span> t
                   <span style="font-weight: bold;">:section-numbers</span> nil)

                  (<span style="font-style: italic;">"static-index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs"</span>
                   <span style="font-weight: bold;">:recursive</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                  (<span style="font-style: italic;">"web-repositorio"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"index"</span> <span style="font-style: italic;">"static-index"</span>)))))

  (message <span style="font-style: italic;">"&#128994; Iniciando publicaci&#243;n del &#237;ndice (web-repositorio)..."</span>)
  (org-publish <span style="font-style: italic;">"web-repositorio"</span> t)
  (message <span style="font-style: italic;">"&#9989; Publicaci&#243;n del &#237;ndice completada."</span>))

(<span style="font-weight: bold;">unless</span> (file-directory-p <span style="font-style: italic;">"logs"</span>)
  (make-directory <span style="font-style: italic;">"logs"</span>))
(<span style="font-weight: bold;">with-temp-file</span> <span style="font-style: italic;">"logs/publica.log"</span>
  (insert (format <span style="font-style: italic;">"Publicado el %s\n"</span> (current-time-string))))

</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-latex-publish-to-pdf</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como PDF despu&#233;s de ejecutar los bloques de c&#243;digo."</span>
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    (org-latex-publish-to-pdf plist filename pub-dir)))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./lecciones/"</span>)
       (public-directory <span style="font-style: italic;">"./docs/"</span>)
       (org-export-with-broken-links t)
       (org-publish-project-alist `((<span style="font-style: italic;">"html"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario"</span>
                                     <span style="font-weight: bold;">:recursive</span> t
                                     <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                                     <span style="font-weight: bold;">:auto-preamble</span> t
                                     <span style="font-weight: bold;">:auto-sitemap</span> nil)
                                    
                                    (<span style="font-style: italic;">"pdf"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,(concat public-directory <span style="font-style: italic;">"pdfs"</span>)
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario"</span>
                                     <span style="font-weight: bold;">:recursive</span> t
                                     <span style="font-weight: bold;">:publishing-function</span> my-org-latex-publish-to-pdf
                                     <span style="font-weight: bold;">:auto-preamble</span> t
                                     <span style="font-weight: bold;">:auto-sitemap</span> nil)
                                    
                                    (<span style="font-style: italic;">"static-html"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">csv</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gdt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">inp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">ipynb"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario"</span>
                                     <span style="font-weight: bold;">:recursive</span> t
                                     <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                                    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">... all the components ...
</span>                                    (<span style="font-style: italic;">"scimax-eln"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"static-html"</span> <span style="font-style: italic;">"pdf"</span>)))))

  (org-publish <span style="font-style: italic;">"scimax-eln"</span> t))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Customize the HTML output
</span>  (<span style="font-weight: bold;">setq</span> org-html-validation-link nil            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't show validation link
</span>        org-html-head-include-scripts nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own scripts
</span>        org-html-head-include-default-style nil <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own styles
</span>        <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">org-html-head "&lt;link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" /&gt;"
</span>   )

  (<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./"</span>)
         (org-export-with-broken-links t)
         (org-publish-project-alist `((<span style="font-style: italic;">"index"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs"</span>
                                     <span style="font-weight: bold;">:recursive</span> nil
                                     <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                                     <span style="font-weight: bold;">:auto-preamble</span> t
                                     <span style="font-weight: bold;">:auto-sitemap</span> t
                                       <span style="font-weight: bold;">:with-author</span> nil           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include author name
</span>                                       <span style="font-weight: bold;">:with-creator</span> nil          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include Emacs and Org versions in footer
</span>                                       <span style="font-weight: bold;">:with-toc</span> t                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include a table of contents
</span>                                       <span style="font-weight: bold;">:section-numbers</span> nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include section numbers
</span>                                       <span style="font-weight: bold;">:time-stamp-file</span> nil)
                                    
                                    (<span style="font-style: italic;">"static-index"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs"</span>
                                     <span style="font-weight: bold;">:recursive</span> nil
                                     <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                                    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">... all the components ...
</span>                                    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">("scimax-eln" :components ("html" "static-html" "pdf")))))
</span>                                    (<span style="font-style: italic;">"web-repositorio"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"index"</span> <span style="font-style: italic;">"static-index"</span>)))))

    (org-publish <span style="font-style: italic;">"web-repositorio"</span> t))
</code></pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-babel-execute-buffer</span> ()
  <span style="font-style: italic;">"Ejecuta todos los bloques de c&#243;digo en el buffer actual."</span>
  (org-babel-execute-buffer))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-html-publish-to-html</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como HTML despu&#233;s de ejecutar los bloques de c&#243;digo."</span>
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(my-org-babel-execute-buffer) ; Ejecuta los bloques
</span>    (org-html-publish-to-html plist filename pub-dir)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-latex-publish-to-pdf</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como PDF despu&#233;s de ejecutar los bloques de c&#243;digo."</span>
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(my-org-babel-execute-buffer) ; Ejecuta los bloques
</span>    (org-latex-publish-to-pdf plist filename pub-dir)))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./lecciones/"</span>)
       (public-directory <span style="font-style: italic;">"./docs/"</span>)
       (org-export-with-broken-links t)
       (org-publish-project-alist `((<span style="font-style: italic;">"html"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">".ipynb_checkpoints</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">00Notas.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publisg.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">kk.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">src"</span>
                                     <span style="font-weight: bold;">:recursive</span> t
                                     <span style="font-weight: bold;">:auto-preamble</span> t
                                     <span style="font-weight: bold;">:auto-sitemap</span> t
                                     <span style="font-weight: bold;">:sitemap-title</span> <span style="font-style: italic;">"Lecciones"</span>
                                     <span style="font-weight: bold;">:publishing-function</span> my-org-html-publish-to-html
                                     <span style="font-weight: bold;">:exclude-tags</span> (<span style="font-style: italic;">"pdf"</span>))
                                   
                                    (<span style="font-style: italic;">"pdf"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,(concat public-directory <span style="font-style: italic;">"pdfs"</span>)
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">".ipynb_checkpoints</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">sitemap.pdf"</span>
                                     <span style="font-weight: bold;">:recursive</span> t
                                     <span style="font-weight: bold;">:auto-preamble</span> t
                                     <span style="font-weight: bold;">:auto-sitemap</span> nil
                                     <span style="font-weight: bold;">:publishing-function</span> my-org-latex-publish-to-pdf)
                                    
                                    (<span style="font-style: italic;">"static-html"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">csv</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gdt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">inp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">ipynb</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">html"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,public-directory
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">EjerciciosHide</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">.ipynb_checkpoints</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publisg.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">kk.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Lecc*.pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">sitemap.pdf"</span>
                                     <span style="font-weight: bold;">:recursive</span> t
                                     <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                                    (<span style="font-style: italic;">"scimax-eln"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"static-html"</span> <span style="font-style: italic;">"pdf"</span>)))))

  (org-publish <span style="font-style: italic;">"scimax-eln"</span> t))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Customize the HTML output
</span>  (<span style="font-weight: bold;">setq</span> org-html-validation-link nil            <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't show validation link
</span>        org-html-head-include-scripts nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own scripts
</span>        org-html-head-include-default-style nil <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Use our own styles
</span>        org-html-head <span style="font-style: italic;">"&lt;link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" /&gt;"</span>)

  (<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./"</span>)
         (org-export-with-broken-links t)
         (org-publish-project-alist `((<span style="font-style: italic;">"index"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publisg.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">chatCopilot.org"</span>
                                     <span style="font-weight: bold;">:recursive</span> nil
                                     <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                                     <span style="font-weight: bold;">:auto-preamble</span> t
                                     <span style="font-weight: bold;">:auto-sitemap</span> t
                                       <span style="font-weight: bold;">:with-author</span> nil           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include author name
</span>                                       <span style="font-weight: bold;">:with-creator</span> nil          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include Emacs and Org versions in footer
</span>                                       <span style="font-weight: bold;">:with-toc</span> t                <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Include a table of contents
</span>                                       <span style="font-weight: bold;">:section-numbers</span> nil       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't include section numbers
</span>                                       <span style="font-weight: bold;">:time-stamp-file</span> nil)
                                    
                                    (<span style="font-style: italic;">"static-index"</span>
                                     <span style="font-weight: bold;">:base-directory</span> ,base-directory
                                     <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">pdf</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff"</span>
                                     <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                                     <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publisg.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">chatCopilot.org"</span>
                                     <span style="font-weight: bold;">:recursive</span> nil
                                     <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                                    <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">... all the components ...
</span>                                    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">("scimax-eln" :components ("html" "static-html" "pdf")))))
</span>                                    (<span style="font-style: italic;">"web-repositorio"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"index"</span> <span style="font-style: italic;">"static-index"</span>)))))

    (org-publish <span style="font-style: italic;">"web-repositorio"</span> t))

</code></pre>
</div>


<p>
Podemos chequear la versión local ejecutando el siguiente bloque
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(browse-url <span style="font-style: italic;">"docs/index.html"</span>)
</code></pre>
</div>
