org-publisg.org
* slides para GitHubpages


[[https://nbconvert.readthedocs.io/en/latest/config_options.html][Configuración para nbconvert]] (las slides usan ficheros de la web para poder funcionar en GitHubPages)

[[https://dbafromthecold.com/2021/02/21/creating-presentations-with-reveal-and-github-pages/][creating-presentations-with-reveal-and-github-pages]]

https://github.com/RichardAfolabi/Presentation_js

https://emasuriano.com/til/2024-07-01-create-presentations-from-notebook/

https://github.com/yjwen/org-reveal
https://github.com/hexmode/ox-reveal

#+BEGIN_SRC python :tangle mycfg-GitHubPages.py
c = get_config()

c.SlidesExporter.reveal_theme = 'solarized'
c.SlidesExporter.reveal_scroll = True
c.SlidesExporter.language_code = 'es'

c.SlidesExporter.mathjax_url = "https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML"

c.SlidesExporter.jquery_url = "https://cdnjs.cloudflare.com/ajax/libs/jquery/3.6.0/jquery.min.js"

c.SlidesExporter.require_js_url = "https://cdnjs.cloudflare.com/ajax/libs/require.js/2.3.6/require.min.js"
#+END_SRC


* COMMENT Ñordas

#+BEGIN_SRC sh :results silent
jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix reveal.js --no-input
#+END_SRC


#+BEGIN_SRC emacs-lisp
(require 'ox-ipynb)
(ox-ipynb-export-org-file-to-ipynb-file "Lecc01.org")
(ox-ipynb-export-org-file-to-ipynb-file "Lecc02.org")
;(ox-ipynb-export-org-file-to-ipynb-file "Lecc03.org")
;(ox-ipynb-export-org-file-to-ipynb-file "Lecc04.org")
;(ox-ipynb-export-org-file-to-ipynb-file "Lecc05.org")
#+END_SRC

#+RESULTS:
: Lecc01.ipynb


# jupyter nbconvert --config mycfg.py
# jupyter nbconvert --config mycfg.py  --to slides --reveal-prefix reveal.js
# jupyter nbconvert --config mycfg.py  --to slides --offline embed --reveal-prefix reveal.js

¿furula? NO
#+BEGIN_SRC emacs-lisp
(require 'package)

(add-to-list 'package-archives (cons "melpa" "https://melpa.org/packages/") t)

(require 'use-package)
(use-package htmlize)

(require 'ox-publish)
;(use-package htmlize)

;(require 'ox-publish)

(defun my-org-babel-execute-buffer ()
  "Ejecuta todos los bloques de código en el buffer actual."
  (org-babel-execute-buffer))

(defun my-org-html-publish-to-html (plist filename pub-dir)
  "Publica un archivo Org como HTML después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    (my-org-babel-execute-buffer) ; Ejecuta los bloques
    (org-html-publish-to-html plist filename pub-dir)))

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    (my-org-babel-execute-buffer) ; Ejecuta los bloques
    (org-latex-publish-to-pdf plist filename pub-dir)))

(let* ((base-directory "./lecciones/")
       (public-directory "./docs/")
       (org-export-with-broken-links t)
       (org-publish-project-alist `(("html"
                                     :base-directory ,base-directory
                                     :base-extension "org"
                                     :publishing-directory ,public-directory
                                     :exclude "docs\\|EjerciciosHide\\|SeriesSimuladas4\\|SeriesSimuladas12\\|Calendario\\|notas.*\\|.ipynb_checkpoints\\|00Notas.*\\|org-publisg.*\\|kk.*"
                                     :recursive t
                                     :publishing-function my-org-html-publish-to-html
                                     :auto-preamble t
                                     :auto-sitemap t)
                                    
                                    ("pdf"
                                     :base-directory ,base-directory
                                     :base-extension "org"
                                     :publishing-directory ,(concat public-directory "pdfs")
                                     :exclude "docs"
                                     :exclude "Calendario"
                                     :exclude ".ipynb_checkpoints"
                                     :exclude "reveal.js.old"
                                     :exclude "notas.*"
                                     :exclude "USB"
                                     :recursive t
                                     :publishing-function my-org-latex-publish-to-pdf
                                     :auto-preamble t
                                     :auto-sitemap nil)
                                    
                                    ("static-html"
                                     :base-directory ,base-directory
                                     :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|svg\\|aiff\\|csv\\|gdt\\|inp\\|ipynb\\|html"
                                     :publishing-directory ,public-directory
                                     :exclude "docs\\|EjerciciosHide\\|SeriesSimuladas4\\|SeriesSimuladas12\\|notas.*\\|.ipynb_checkpoints\\|org-publisg.*\\|kk.*\\|Lecc*.pdf"
                                     :recursive t
                                     :publishing-function org-publish-attachment)

                                    ("scimax-eln" :components ("html" "static-html" "pdf")))))

  (org-publish "scimax-eln" t))
#+END_SRC

#+RESULTS:



#+BEGIN_SRC emacs-lisp
(require 'package)

(add-to-list 'package-archives (cons "melpa" "https://melpa.org/packages/") t)

(require 'use-package)
(use-package htmlize)

(require 'ox-publish)

(defun my-org-babel-execute-buffer ()
  "Ejecuta todos los bloques de código en el buffer actual."
  (org-babel-execute-buffer))

(defun my-org-html-publish-to-html (plist filename pub-dir)
  "Publica un archivo Org como HTML después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    (my-org-babel-execute-buffer) ; Ejecuta los bloques
    (org-html-publish-to-html plist filename pub-dir)))

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF después de ejecutar los bloques de código."
  (with-current-buffer (find-file-noselect filename)
    (my-org-babel-execute-buffer) ; Ejecuta los bloques
    (org-latex-publish-to-pdf plist filename pub-dir)))

(let* ((base-directory "./lecciones/")
       (public-directory "./docs/")
       (org-export-with-broken-links t)
       (org-publish-project-alist `(("html"
                                     :base-directory ,base-directory
                                     :base-extension "org"
                                     :publishing-directory ,public-directory
                                     :exclude "docs\\|EjerciciosHide\\|SeriesSimuladas4\\|SeriesSimuladas12\\|Calendario\\|notas.*\\|.ipynb_checkpoints\\|00Notas.*\\|org-publisg.*\\|kk.*"
                                     :recursive t
                                     :publishing-function my-org-html-publish-to-html
                                     :auto-preamble t
                                     :auto-sitemap t)
                                    
                                    ("pdf"
                                     :base-directory ,base-directory
                                     :base-extension "org"
                                     :publishing-directory ,(concat public-directory "pdfs")
                                     :exclude "docs"
                                     :exclude "Calendario"
                                     :exclude ".ipynb_checkpoints"
                                     :exclude "reveal.js.old"
                                     :exclude "notas.*"
                                     :exclude "USB"
                                     :recursive t
                                     :publishing-function my-org-latex-publish-to-pdf
                                     :auto-preamble t
                                     :auto-sitemap nil)
                                    
                                    ("static-html"
                                     :base-directory ,base-directory
                                     :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|dat\\|mov\\|svg\\|aiff\\|csv\\|gdt\\|inp\\|ipynb\\|html"
                                     :publishing-directory ,public-directory
                                     :exclude "docs\\|EjerciciosHide\\|SeriesSimuladas4\\|SeriesSimuladas12\\|notas.*\\|.ipynb_checkpoints\\|org-publisg.*\\|kk.*\\|Lecc*.pdf"
                                     :recursive t
                                     :publishing-function org-publish-attachment)

                                    ("scimax-eln" :components ("html" "static-html" "pdf")))))

  (org-publish "scimax-eln" t))
#+END_SRC

clean:
	rm -r -f $(DOCS)
	rm -r -f $(LECCIONES)
	rm -f directorios
	rm -f series_formales


#+BEGIN_SRC bash  :results silent
rm Lecc*.{pdf,slides.html}
#+END_SRC

#+BEGIN_SRC  makefile :noweb no-export :results silent :exports none 
OUT_DIR=./
# Using GNU Make-specific functions here
FILES=$(patsubst Lecc%.org,$(OUT_DIR)/Lecc%.tex,$(wildcard *.org))
PDF-FILES=$(patsubst Lecc%.tex,$(OUT_DIR)/Lecc%.pdf,$(wildcard *.tex))

#.PHONY: all clean install-doc
.PHONY: all install-doc

Lecc01.pdf: %.tex
	latexmk -c $@ 

all: install-doc

#install-doc: $(FILES)  $(PDF-FILES)
install-doc: $(PDF-FILES)

$(OUT_DIR):
	mkdir -v -p $(OUT_DIR)

#%.tex: %.org
#	emacs -q -l ~/Software/scimax/init.el $< --batch -f org-latex-export-to-latex --kill

%.pdf: %.tex
	latexmk -pdf --shell-escape -interaction=batchmode $< 
	latexmk -c

pedeefes: %.pdf

#$(OUT_DIR)/%.tex: %.tex
#	install -v -m 644 -t $(OUT_DIR) $<
#	rm $<
$(OUT_DIR)/%.pdf: %.pdf
	install -v -m 644 -t ./notas $<

#clean:
#	rm *.tex
#+END_SRC


