docs/org-publisg.html
<div id="outline-container-org78639da" class="outline-2">
<h2 id="org78639da">slides para GitHubpages</h2>
<div class="outline-text-2" id="text-org78639da">
<p>
<a href="https://nbconvert.readthedocs.io/en/latest/config_options.html">Configuración para nbconvert</a> (las slides usan ficheros de la web para poder funcionar en GitHubPages)
</p>

<p>
<a href="https://dbafromthecold.com/2021/02/21/creating-presentations-with-reveal-and-github-pages/">creating-presentations-with-reveal-and-github-pages</a>
</p>

<p>
<a href="https://github.com/RichardAfolabi/Presentation_js">https://github.com/RichardAfolabi/Presentation_js</a>
</p>

<p>
<a href="https://emasuriano.com/til/2024-07-01-create-presentations-from-notebook/">https://emasuriano.com/til/2024-07-01-create-presentations-from-notebook/</a>
</p>

<p>
<a href="https://github.com/yjwen/org-reveal">https://github.com/yjwen/org-reveal</a>
<a href="https://github.com/hexmode/ox-reveal">https://github.com/hexmode/ox-reveal</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="font-weight: bold; font-style: italic;">c</span> = get_config()

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">reveal_theme</span> = <span style="font-style: italic;">'solarized'</span>
c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">reveal_scroll</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">language_code</span> = <span style="font-style: italic;">'es'</span>

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">mathjax_url</span> = <span style="font-style: italic;">"https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML"</span>

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">jquery_url</span> = <span style="font-style: italic;">"https://cdnjs.cloudflare.com/ajax/libs/jquery/3.6.0/jquery.min.js"</span>

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">require_js_url</span> = <span style="font-style: italic;">"https://cdnjs.cloudflare.com/ajax/libs/require.js/2.3.6/require.min.js"</span>
</code></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-07-25 Fri 14:41</p>
</div>
</body>
</html>
